Tekla.Structures.DirectManipulation.Model.SurfacePreviewProvider
The Tekla.Structures.DirectManipulation.Model.SurfacePreviewProvider provides the previews of surface objects from TS core.

Tekla.Structures.DirectManipulation.Model.SurfacePreviewProvider.GetSurfaceCreationPreview(System.Int32,Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.UnitVector3)
Gets the preview for the surface object.
id: The ID of the underlying model object.
pointOnFace: The point on the face of the underlying model object.
faceNormal: The normal of the face of the underlying model object.
Returns:
The list of Tekla.Structures.Geometry3d.FacetedBrep if the preview could be created; null otherwise